In [5]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from scipy.stats import linregress

In [2]:
#import ATL data
atl_path = "AtlantaCrimeCate.csv"
atlanta_df = pd.read_csv(atl_path)
atlanta_df = atlanta_df.rename(columns={"Crime":"Crime Count", "Date of Crime":"Date"})
atlanta_df.head()

      Date  Crime Count  Violent Crime  NonViolent Crime
0   1/1/15           87             30                57
1  1/10/15           71             17                54
2  1/11/15           82             23                59
3  1/12/15           95             25                70
4  1/13/15           64             26                38

In [3]:
#import PDX data
pdx_path = "PortlandCrimeCate.csv"
portland_df = pd.read_csv(pdx_path)
portland_df = portland_df.rename(columns={"Offense Type":"Crime Count", "Occur Date":"Date"})
portland_df.head()

        Date  Crime Count  Violent Crime  NonViolent Crime
0   1/1/2015           44           11.0              33.0
1  1/10/2015            1            0.0               1.0
2  1/11/2015            3            0.0               3.0
3  1/12/2015            2            1.0               1.0
4  1/13/2015            3            1.0               2.0

In [ ]:
#import CHI data ####waiting for branch update
chi_path = "Place_Holder"
chicago_df = pd.read_csv(chi_path)

In [8]:
#import moon data dates and phase
moon_path = "Resources/MoonPhase.csv"
moon_df = pd.read_csv(moon_path)
moon_df.head()

      Moon Phase       Date Special Special Type
0      Full Moon   1/4/2015       n          NaN
1  Third Quarter  1/13/2015       n          NaN
2       New Moon  1/20/2015       n          NaN
3  First Quarter  1/26/2015       n          NaN
4      Full Moon   2/3/2015       n          NaN

In [9]:
atl_pdx_total = pd.DataFrame(portland_df['Date'])
atl_pdx_total["Total Crime Count"] = atlanta_df['Crime Count'] + portland_df["Crime Count"]
atl_pdx_total["Total Violent Crime"] = atlanta_df['Violent Crime'] + portland_df["Violent Crime"]
atl_pdx_total["Total NonViolent Crime"] = atlanta_df['NonViolent Crime'] + portland_df["NonViolent Crime"]
atl_pdx_total.head()

        Date  Total Crime Count  Total Violent Crime  Total NonViolent Crime
0   1/1/2015              131.0                 41.0                    90.0
1  1/10/2015               72.0                 17.0                    55.0
2  1/11/2015               85.0                 23.0                    62.0
3  1/12/2015               97.0                 26.0                    71.0
4  1/13/2015               67.0                 27.0                    40.0

In [10]:
atl_pdx_moon_merge = pd.merge(atl_pdx_total, moon_df, how="outer", on = "Date")
atl_pdx_moon_merge.head()

,Date,Total Crime Count,Total Violent Crime,Total NonViolent Crime,Moon Phase,Special,Special Type
0,1/1/2015,131.0,41.0,90.0,NaN,NaN,NaN
1,1/10/2015,72.0,17.0,55.0,NaN,NaN,NaN
2,1/11/2015,85.0,23.0,62.0,NaN,NaN,NaN
3,1/12/2015,97.0,26.0,71.0,NaN,NaN,NaN
4,1/13/2015,67.0,27.0,40.0,Third Quarter,n,NaN